classroom_reservation_api/app/controllers/api/v1/reservations_controller.rb

INSERT INTO "reservations" ("user_name", "classroom_name", "start_time", "end_time", "password_digest", "created_at", "updated_at", "classroom_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @reservation = Reservation.new(reservation_params)

    if overlapping_reservation_exists?
      render json: { error: '指定された時間にはすでに予約があります。' }, status: :unprocessable_entity
    else
      if @reservation.save

DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 19]]
---
  def destroy
    if params[:password] == ADMIN_PASSWORD || @reservation.authenticate(params[:password])
      @reservation.destroy

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def set_reservation
    @reservation = Reservation.find(params[:id])

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
SELECT 1 AS one FROM "reservations" WHERE "reservations"."classroom_id" = ? AND (start_time < '2023-07-06 14:50:00' AND end_time > '2023-07-06 14:30:00') LIMIT ?  [["classroom_id", 0], ["LIMIT", 1]]
---
  def overlapping_reservation_exists?
    Reservation.where(classroom_id: @reservation.classroom_id)
               .where('start_time < ? AND end_time > ?', @reservation.end_time, @reservation.start_time)
               .exists?